test-scripts/testcases/3nodes-1client/TestCase-20mil-100k-4k-2020-09-11-00:54:11/perf-test.txt
18211 records sent, 3642.2 records/sec (14.23 MB/sec), 1006.0 ms avg latency, 1706.0 ms max latency.
40620 records sent, 8124.0 records/sec (31.73 MB/sec), 700.4 ms avg latency, 1795.0 ms max latency.
43716 records sent, 8743.2 records/sec (34.15 MB/sec), 663.0 ms avg latency, 2285.0 ms max latency.
43149 records sent, 8629.8 records/sec (33.71 MB/sec), 703.5 ms avg latency, 2201.0 ms max latency.
84385 records sent, 16877.0 records/sec (65.93 MB/sec), 413.3 ms avg latency, 2278.0 ms max latency.
107379 records sent, 21475.8 records/sec (83.89 MB/sec), 286.5 ms avg latency, 897.0 ms max latency.
109299 records sent, 21859.8 records/sec (85.39 MB/sec), 281.5 ms avg latency, 957.0 ms max latency.
108724 records sent, 21744.8 records/sec (84.94 MB/sec), 282.7 ms avg latency, 882.0 ms max latency.
108160 records sent, 21632.0 records/sec (84.50 MB/sec), 283.4 ms avg latency, 889.0 ms max latency.
108166 records sent, 21633.2 records/sec (84.50 MB/sec), 283.0 ms avg latency, 903.0 ms max latency.
107024 records sent, 21404.8 records/sec (83.61 MB/sec), 283.9 ms avg latency, 953.0 ms max latency.
104348 records sent, 20869.6 records/sec (81.52 MB/sec), 295.8 ms avg latency, 1038.0 ms max latency.
106397 records sent, 21279.4 records/sec (83.12 MB/sec), 288.4 ms avg latency, 944.0 ms max latency.
107792 records sent, 21558.4 records/sec (84.21 MB/sec), 285.9 ms avg latency, 945.0 ms max latency.
107288 records sent, 21457.6 records/sec (83.82 MB/sec), 286.3 ms avg latency, 953.0 ms max latency.
105567 records sent, 21113.4 records/sec (82.47 MB/sec), 288.6 ms avg latency, 950.0 ms max latency.
106819 records sent, 21363.8 records/sec (83.45 MB/sec), 288.5 ms avg latency, 917.0 ms max latency.
109538 records sent, 21907.6 records/sec (85.58 MB/sec), 280.4 ms avg latency, 890.0 ms max latency.
106536 records sent, 21307.2 records/sec (83.23 MB/sec), 287.6 ms avg latency, 944.0 ms max latency.
105786 records sent, 21157.2 records/sec (82.65 MB/sec), 292.0 ms avg latency, 1021.0 ms max latency.
110289 records sent, 22057.8 records/sec (86.16 MB/sec), 278.3 ms avg latency, 890.0 ms max latency.
105545 records sent, 21109.0 records/sec (82.46 MB/sec), 289.0 ms avg latency, 918.0 ms max latency.
107060 records sent, 21412.0 records/sec (83.64 MB/sec), 285.9 ms avg latency, 950.0 ms max latency.
106436 records sent, 21287.2 records/sec (83.15 MB/sec), 289.6 ms avg latency, 907.0 ms max latency.
106977 records sent, 21395.4 records/sec (83.58 MB/sec), 287.1 ms avg latency, 906.0 ms max latency.
107920 records sent, 21584.0 records/sec (84.31 MB/sec), 284.0 ms avg latency, 891.0 ms max latency.
109447 records sent, 21889.4 records/sec (85.51 MB/sec), 282.1 ms avg latency, 882.0 ms max latency.
107057 records sent, 21411.4 records/sec (83.64 MB/sec), 284.7 ms avg latency, 956.0 ms max latency.
109171 records sent, 21834.2 records/sec (85.29 MB/sec), 282.1 ms avg latency, 909.0 ms max latency.
106778 records sent, 21355.6 records/sec (83.42 MB/sec), 285.8 ms avg latency, 912.0 ms max latency.
105311 records sent, 21062.2 records/sec (82.27 MB/sec), 290.7 ms avg latency, 955.0 ms max latency.
106073 records sent, 21214.6 records/sec (82.87 MB/sec), 292.0 ms avg latency, 960.0 ms max latency.
106130 records sent, 21226.0 records/sec (82.91 MB/sec), 286.7 ms avg latency, 952.0 ms max latency.
107306 records sent, 21461.2 records/sec (83.83 MB/sec), 288.7 ms avg latency, 961.0 ms max latency.
107576 records sent, 21515.2 records/sec (84.04 MB/sec), 285.4 ms avg latency, 919.0 ms max latency.
106644 records sent, 21328.8 records/sec (83.32 MB/sec), 288.2 ms avg latency, 973.0 ms max latency.
108874 records sent, 21774.8 records/sec (85.06 MB/sec), 281.7 ms avg latency, 910.0 ms max latency.
108099 records sent, 21619.8 records/sec (84.45 MB/sec), 284.6 ms avg latency, 888.0 ms max latency.
106054 records sent, 21210.8 records/sec (82.85 MB/sec), 289.0 ms avg latency, 945.0 ms max latency.
104839 records sent, 20967.8 records/sec (81.91 MB/sec), 292.5 ms avg latency, 977.0 ms max latency.
107437 records sent, 21487.4 records/sec (83.94 MB/sec), 288.1 ms avg latency, 909.0 ms max latency.
106917 records sent, 21383.4 records/sec (83.53 MB/sec), 285.6 ms avg latency, 891.0 ms max latency.
107848 records sent, 21569.6 records/sec (84.26 MB/sec), 286.1 ms avg latency, 897.0 ms max latency.
107153 records sent, 21430.6 records/sec (83.71 MB/sec), 284.6 ms avg latency, 957.0 ms max latency.
103358 records sent, 20671.6 records/sec (80.75 MB/sec), 294.6 ms avg latency, 971.0 ms max latency.
106141 records sent, 21228.2 records/sec (82.92 MB/sec), 289.6 ms avg latency, 971.0 ms max latency.
108987 records sent, 21797.4 records/sec (85.15 MB/sec), 285.7 ms avg latency, 900.0 ms max latency.
108676 records sent, 21735.2 records/sec (84.90 MB/sec), 280.8 ms avg latency, 887.0 ms max latency.
105312 records sent, 21062.4 records/sec (82.28 MB/sec), 289.9 ms avg latency, 974.0 ms max latency.
101623 records sent, 20324.6 records/sec (79.39 MB/sec), 299.6 ms avg latency, 966.0 ms max latency.
102119 records sent, 20423.8 records/sec (79.78 MB/sec), 300.4 ms avg latency, 1002.0 ms max latency.
107127 records sent, 21425.4 records/sec (83.69 MB/sec), 290.5 ms avg latency, 1009.0 ms max latency.
106200 records sent, 21240.0 records/sec (82.97 MB/sec), 289.0 ms avg latency, 912.0 ms max latency.
107453 records sent, 21490.6 records/sec (83.95 MB/sec), 286.5 ms avg latency, 972.0 ms max latency.
108073 records sent, 21614.6 records/sec (84.43 MB/sec), 284.3 ms avg latency, 943.0 ms max latency.
107567 records sent, 21513.4 records/sec (84.04 MB/sec), 284.5 ms avg latency, 904.0 ms max latency.
105726 records sent, 21145.2 records/sec (82.60 MB/sec), 288.9 ms avg latency, 898.0 ms max latency.
107163 records sent, 21432.6 records/sec (83.72 MB/sec), 286.6 ms avg latency, 909.0 ms max latency.
107086 records sent, 21417.2 records/sec (83.66 MB/sec), 287.1 ms avg latency, 903.0 ms max latency.
105286 records sent, 21057.2 records/sec (82.25 MB/sec), 290.8 ms avg latency, 910.0 ms max latency.
68133 records sent, 13626.6 records/sec (53.23 MB/sec), 424.3 ms avg latency, 1986.0 ms max latency.
106988 records sent, 21397.6 records/sec (83.58 MB/sec), 304.1 ms avg latency, 1689.0 ms max latency.
107719 records sent, 21543.8 records/sec (84.16 MB/sec), 285.7 ms avg latency, 905.0 ms max latency.
108827 records sent, 21765.4 records/sec (85.02 MB/sec), 282.9 ms avg latency, 905.0 ms max latency.
108736 records sent, 21747.2 records/sec (84.95 MB/sec), 280.2 ms avg latency, 900.0 ms max latency.
107525 records sent, 21505.0 records/sec (84.00 MB/sec), 286.5 ms avg latency, 964.0 ms max latency.
106459 records sent, 21291.8 records/sec (83.17 MB/sec), 288.4 ms avg latency, 972.0 ms max latency.
106875 records sent, 21375.0 records/sec (83.50 MB/sec), 287.0 ms avg latency, 956.0 ms max latency.
106352 records sent, 21270.4 records/sec (83.09 MB/sec), 288.9 ms avg latency, 917.0 ms max latency.
107004 records sent, 21400.8 records/sec (83.60 MB/sec), 286.8 ms avg latency, 947.0 ms max latency.
109339 records sent, 21863.4 records/sec (85.40 MB/sec), 281.8 ms avg latency, 948.0 ms max latency.
108994 records sent, 21798.8 records/sec (85.15 MB/sec), 280.6 ms avg latency, 894.0 ms max latency.
108091 records sent, 21618.2 records/sec (84.45 MB/sec), 283.0 ms avg latency, 889.0 ms max latency.
104464 records sent, 20892.8 records/sec (81.61 MB/sec), 295.8 ms avg latency, 991.0 ms max latency.
106009 records sent, 21201.8 records/sec (82.82 MB/sec), 288.5 ms avg latency, 945.0 ms max latency.
107067 records sent, 21413.4 records/sec (83.65 MB/sec), 287.0 ms avg latency, 915.0 ms max latency.
106162 records sent, 21232.4 records/sec (82.94 MB/sec), 289.5 ms avg latency, 934.0 ms max latency.
106386 records sent, 21277.2 records/sec (83.11 MB/sec), 289.2 ms avg latency, 951.0 ms max latency.
109257 records sent, 21851.4 records/sec (85.36 MB/sec), 281.5 ms avg latency, 897.0 ms max latency.
106517 records sent, 21303.4 records/sec (83.22 MB/sec), 287.4 ms avg latency, 942.0 ms max latency.
106808 records sent, 21361.6 records/sec (83.44 MB/sec), 288.3 ms avg latency, 909.0 ms max latency.
108011 records sent, 21602.2 records/sec (84.38 MB/sec), 284.1 ms avg latency, 914.0 ms max latency.
107308 records sent, 21461.6 records/sec (83.83 MB/sec), 285.6 ms avg latency, 915.0 ms max latency.
105865 records sent, 21173.0 records/sec (82.71 MB/sec), 288.6 ms avg latency, 949.0 ms max latency.
105932 records sent, 21186.4 records/sec (82.76 MB/sec), 290.7 ms avg latency, 956.0 ms max latency.
108241 records sent, 21648.2 records/sec (84.56 MB/sec), 284.1 ms avg latency, 920.0 ms max latency.
103691 records sent, 20738.2 records/sec (81.01 MB/sec), 294.4 ms avg latency, 981.0 ms max latency.
106797 records sent, 21359.4 records/sec (83.44 MB/sec), 288.3 ms avg latency, 956.0 ms max latency.
107052 records sent, 21410.4 records/sec (83.63 MB/sec), 288.4 ms avg latency, 953.0 ms max latency.
109033 records sent, 21806.6 records/sec (85.18 MB/sec), 281.5 ms avg latency, 887.0 ms max latency.
110264 records sent, 22052.8 records/sec (86.14 MB/sec), 278.7 ms avg latency, 893.0 ms max latency.
108142 records sent, 21628.4 records/sec (84.49 MB/sec), 281.8 ms avg latency, 954.0 ms max latency.
111236 records sent, 22247.2 records/sec (86.90 MB/sec), 275.9 ms avg latency, 964.0 ms max latency.
111034 records sent, 22206.8 records/sec (86.75 MB/sec), 277.4 ms avg latency, 886.0 ms max latency.
104516 records sent, 20903.2 records/sec (81.65 MB/sec), 294.5 ms avg latency, 1001.0 ms max latency.
104215 records sent, 20843.0 records/sec (81.42 MB/sec), 294.4 ms avg latency, 981.0 ms max latency.
105349 records sent, 21069.8 records/sec (82.30 MB/sec), 292.1 ms avg latency, 951.0 ms max latency.
106613 records sent, 21322.6 records/sec (83.29 MB/sec), 286.9 ms avg latency, 958.0 ms max latency.
106530 records sent, 21306.0 records/sec (83.23 MB/sec), 287.9 ms avg latency, 949.0 ms max latency.
106152 records sent, 21230.4 records/sec (82.93 MB/sec), 287.8 ms avg latency, 951.0 ms max latency.
107488 records sent, 21497.6 records/sec (83.98 MB/sec), 287.7 ms avg latency, 907.0 ms max latency.
109283 records sent, 21852.2 records/sec (85.36 MB/sec), 278.3 ms avg latency, 903.0 ms max latency.
107634 records sent, 21526.8 records/sec (84.09 MB/sec), 287.5 ms avg latency, 960.0 ms max latency.
105319 records sent, 21063.8 records/sec (82.28 MB/sec), 290.5 ms avg latency, 969.0 ms max latency.
111028 records sent, 22205.6 records/sec (86.74 MB/sec), 277.7 ms avg latency, 877.0 ms max latency.
106071 records sent, 21214.2 records/sec (82.87 MB/sec), 286.8 ms avg latency, 944.0 ms max latency.
107122 records sent, 21424.4 records/sec (83.69 MB/sec), 288.8 ms avg latency, 915.0 ms max latency.
108450 records sent, 21690.0 records/sec (84.73 MB/sec), 283.2 ms avg latency, 888.0 ms max latency.
100747 records sent, 20149.4 records/sec (78.71 MB/sec), 305.6 ms avg latency, 1090.0 ms max latency.
106530 records sent, 21306.0 records/sec (83.23 MB/sec), 285.5 ms avg latency, 898.0 ms max latency.
106557 records sent, 21311.4 records/sec (83.25 MB/sec), 286.9 ms avg latency, 942.0 ms max latency.
107771 records sent, 21554.2 records/sec (84.20 MB/sec), 286.5 ms avg latency, 962.0 ms max latency.
108087 records sent, 21617.4 records/sec (84.44 MB/sec), 283.9 ms avg latency, 898.0 ms max latency.
110320 records sent, 22064.0 records/sec (86.19 MB/sec), 280.4 ms avg latency, 910.0 ms max latency.
107815 records sent, 21563.0 records/sec (84.23 MB/sec), 283.1 ms avg latency, 886.0 ms max latency.
106647 records sent, 21329.4 records/sec (83.32 MB/sec), 287.7 ms avg latency, 912.0 ms max latency.
106917 records sent, 21383.4 records/sec (83.53 MB/sec), 286.2 ms avg latency, 917.0 ms max latency.
107116 records sent, 21423.2 records/sec (83.68 MB/sec), 288.5 ms avg latency, 897.0 ms max latency.
106524 records sent, 21292.0 records/sec (83.17 MB/sec), 285.9 ms avg latency, 952.0 ms max latency.
108690 records sent, 21738.0 records/sec (84.91 MB/sec), 282.4 ms avg latency, 903.0 ms max latency.
106051 records sent, 21210.2 records/sec (82.85 MB/sec), 290.6 ms avg latency, 963.0 ms max latency.
106235 records sent, 21247.0 records/sec (83.00 MB/sec), 288.7 ms avg latency, 949.0 ms max latency.
107415 records sent, 21483.0 records/sec (83.92 MB/sec), 286.1 ms avg latency, 911.0 ms max latency.
107349 records sent, 21469.8 records/sec (83.87 MB/sec), 284.7 ms avg latency, 937.0 ms max latency.
109052 records sent, 21810.4 records/sec (85.20 MB/sec), 280.8 ms avg latency, 949.0 ms max latency.
106503 records sent, 21300.6 records/sec (83.21 MB/sec), 289.0 ms avg latency, 945.0 ms max latency.
107317 records sent, 21463.4 records/sec (83.84 MB/sec), 287.5 ms avg latency, 909.0 ms max latency.
108977 records sent, 21795.4 records/sec (85.14 MB/sec), 282.3 ms avg latency, 890.0 ms max latency.
104489 records sent, 20897.8 records/sec (81.63 MB/sec), 291.0 ms avg latency, 954.0 ms max latency.
101961 records sent, 20392.2 records/sec (79.66 MB/sec), 301.1 ms avg latency, 972.0 ms max latency.
107655 records sent, 21531.0 records/sec (84.11 MB/sec), 287.1 ms avg latency, 959.0 ms max latency.
105839 records sent, 21167.8 records/sec (82.69 MB/sec), 289.7 ms avg latency, 951.0 ms max latency.
107356 records sent, 21471.2 records/sec (83.87 MB/sec), 285.7 ms avg latency, 955.0 ms max latency.
106790 records sent, 21358.0 records/sec (83.43 MB/sec), 288.0 ms avg latency, 895.0 ms max latency.
109305 records sent, 21861.0 records/sec (85.39 MB/sec), 281.1 ms avg latency, 895.0 ms max latency.
108022 records sent, 21604.4 records/sec (84.39 MB/sec), 283.8 ms avg latency, 890.0 ms max latency.
110403 records sent, 22080.6 records/sec (86.25 MB/sec), 279.2 ms avg latency, 907.0 ms max latency.
106773 records sent, 21354.6 records/sec (83.42 MB/sec), 285.2 ms avg latency, 950.0 ms max latency.
108728 records sent, 21745.6 records/sec (84.94 MB/sec), 283.5 ms avg latency, 957.0 ms max latency.
106502 records sent, 21300.4 records/sec (83.20 MB/sec), 288.0 ms avg latency, 904.0 ms max latency.
110145 records sent, 22029.0 records/sec (86.05 MB/sec), 280.1 ms avg latency, 896.0 ms max latency.
106894 records sent, 21378.8 records/sec (83.51 MB/sec), 286.4 ms avg latency, 945.0 ms max latency.
110874 records sent, 22174.8 records/sec (86.62 MB/sec), 278.1 ms avg latency, 889.0 ms max latency.
107615 records sent, 21523.0 records/sec (84.07 MB/sec), 284.1 ms avg latency, 911.0 ms max latency.
105741 records sent, 21148.2 records/sec (82.61 MB/sec), 288.9 ms avg latency, 900.0 ms max latency.
104790 records sent, 20958.0 records/sec (81.87 MB/sec), 293.5 ms avg latency, 957.0 ms max latency.
108392 records sent, 21678.4 records/sec (84.68 MB/sec), 285.0 ms avg latency, 945.0 ms max latency.
103984 records sent, 20796.8 records/sec (81.24 MB/sec), 293.7 ms avg latency, 955.0 ms max latency.
108426 records sent, 21685.2 records/sec (84.71 MB/sec), 284.1 ms avg latency, 968.0 ms max latency.
108923 records sent, 21784.6 records/sec (85.10 MB/sec), 281.0 ms avg latency, 904.0 ms max latency.
106212 records sent, 21242.4 records/sec (82.98 MB/sec), 289.4 ms avg latency, 977.0 ms max latency.
107376 records sent, 21475.2 records/sec (83.89 MB/sec), 286.1 ms avg latency, 896.0 ms max latency.
108094 records sent, 21618.8 records/sec (84.45 MB/sec), 285.3 ms avg latency, 886.0 ms max latency.
107078 records sent, 21415.6 records/sec (83.65 MB/sec), 284.8 ms avg latency, 949.0 ms max latency.
106555 records sent, 21311.0 records/sec (83.25 MB/sec), 288.3 ms avg latency, 959.0 ms max latency.
107193 records sent, 21438.6 records/sec (83.74 MB/sec), 286.8 ms avg latency, 945.0 ms max latency.
106705 records sent, 21341.0 records/sec (83.36 MB/sec), 287.1 ms avg latency, 962.0 ms max latency.
105861 records sent, 21172.2 records/sec (82.70 MB/sec), 290.6 ms avg latency, 949.0 ms max latency.
105781 records sent, 21156.2 records/sec (82.64 MB/sec), 289.6 ms avg latency, 963.0 ms max latency.
107585 records sent, 21517.0 records/sec (84.05 MB/sec), 286.4 ms avg latency, 952.0 ms max latency.
107990 records sent, 21598.0 records/sec (84.37 MB/sec), 284.5 ms avg latency, 886.0 ms max latency.
109631 records sent, 21926.2 records/sec (85.65 MB/sec), 280.3 ms avg latency, 882.0 ms max latency.
106696 records sent, 21339.2 records/sec (83.36 MB/sec), 287.5 ms avg latency, 956.0 ms max latency.
108232 records sent, 21646.4 records/sec (84.56 MB/sec), 283.9 ms avg latency, 893.0 ms max latency.
108763 records sent, 21752.6 records/sec (84.97 MB/sec), 282.2 ms avg latency, 882.0 ms max latency.
108136 records sent, 21627.2 records/sec (84.48 MB/sec), 283.0 ms avg latency, 900.0 ms max latency.
107986 records sent, 21282.2 records/sec (83.13 MB/sec), 281.8 ms avg latency, 976.0 ms max latency.
108768 records sent, 21723.2 records/sec (84.86 MB/sec), 289.3 ms avg latency, 982.0 ms max latency.
107133 records sent, 21426.6 records/sec (83.70 MB/sec), 287.1 ms avg latency, 959.0 ms max latency.
108802 records sent, 21760.4 records/sec (85.00 MB/sec), 280.7 ms avg latency, 889.0 ms max latency.
108070 records sent, 21614.0 records/sec (84.43 MB/sec), 285.5 ms avg latency, 888.0 ms max latency.
107935 records sent, 21587.0 records/sec (84.32 MB/sec), 283.0 ms avg latency, 893.0 ms max latency.
109309 records sent, 21861.8 records/sec (85.40 MB/sec), 281.9 ms avg latency, 905.0 ms max latency.
106935 records sent, 21387.0 records/sec (83.54 MB/sec), 285.5 ms avg latency, 906.0 ms max latency.
110492 records sent, 22098.4 records/sec (86.32 MB/sec), 278.6 ms avg latency, 915.0 ms max latency.
111066 records sent, 22213.2 records/sec (86.77 MB/sec), 276.8 ms avg latency, 938.0 ms max latency.
109710 records sent, 21942.0 records/sec (85.71 MB/sec), 278.5 ms avg latency, 884.0 ms max latency.
110553 records sent, 22110.6 records/sec (86.37 MB/sec), 278.3 ms avg latency, 885.0 ms max latency.
107334 records sent, 21466.8 records/sec (83.85 MB/sec), 286.1 ms avg latency, 909.0 ms max latency.
108879 records sent, 21775.8 records/sec (85.06 MB/sec), 282.4 ms avg latency, 906.0 ms max latency.
108577 records sent, 21715.4 records/sec (84.83 MB/sec), 281.8 ms avg latency, 907.0 ms max latency.
100988 records sent, 20197.6 records/sec (78.90 MB/sec), 302.6 ms avg latency, 983.0 ms max latency.
109043 records sent, 21808.6 records/sec (85.19 MB/sec), 284.5 ms avg latency, 956.0 ms max latency.
109407 records sent, 21881.4 records/sec (85.47 MB/sec), 280.8 ms avg latency, 882.0 ms max latency.
109126 records sent, 21825.2 records/sec (85.25 MB/sec), 281.2 ms avg latency, 889.0 ms max latency.
108834 records sent, 21766.8 records/sec (85.03 MB/sec), 281.1 ms avg latency, 951.0 ms max latency.
109425 records sent, 21885.0 records/sec (85.49 MB/sec), 279.3 ms avg latency, 891.0 ms max latency.
108551 records sent, 21710.2 records/sec (84.81 MB/sec), 283.5 ms avg latency, 895.0 ms max latency.
108550 records sent, 21710.0 records/sec (84.80 MB/sec), 282.2 ms avg latency, 909.0 ms max latency.
20000000 records sent, 21093.619813 records/sec (82.40 MB/sec), 290.50 ms avg latency, 2285.00 ms max latency, 1 ms 50th, 887 ms 95th, 921 ms 99th, 2100 ms 99.9th.

Metric Name                                                                         Value
app-info:commit-id:{client-id=producer-1}                                         : f960e3745ec74111
app-info:start-time-ms:{client-id=producer-1}                                     : 1599756861549
app-info:version:{client-id=producer-1}                                           : 2.5.0.redhat-00003
kafka-metrics-count:count:{client-id=producer-1}                                  : 126.000
producer-metrics:batch-size-avg:{client-id=producer-1}                            : 12251.012
producer-metrics:batch-size-max:{client-id=producer-1}                            : 12376.000
producer-metrics:batch-split-rate:{client-id=producer-1}                          : 0.000
producer-metrics:batch-split-total:{client-id=producer-1}                         : 0.000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                    : 33554432.000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                     : 0.000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                    : 0.000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                        : 33554432.000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                     : 0.919
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                : 882115242958.000
producer-metrics:compression-rate-avg:{client-id=producer-1}                      : 1.000
producer-metrics:connection-close-rate:{client-id=producer-1}                     : 0.000
producer-metrics:connection-close-total:{client-id=producer-1}                    : 1.000
producer-metrics:connection-count:{client-id=producer-1}                          : 3.000
producer-metrics:connection-creation-rate:{client-id=producer-1}                  : 0.000
producer-metrics:connection-creation-total:{client-id=producer-1}                 : 4.000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                : 0.000
producer-metrics:failed-authentication-total:{client-id=producer-1}               : 0.000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}              : 0.000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}             : 0.000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                        : 463487.188
producer-metrics:incoming-byte-total:{client-id=producer-1}                       : 431049396.000
producer-metrics:io-ratio:{client-id=producer-1}                                  : 0.209
producer-metrics:io-time-ns-avg:{client-id=producer-1}                            : 19022.233
producer-metrics:io-wait-ratio:{client-id=producer-1}                             : 0.529
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                       : 48096.497
producer-metrics:io-waittime-total:{client-id=producer-1}                         : 506165665902.000
producer-metrics:iotime-total:{client-id=producer-1}                              : 193125585264.000
producer-metrics:metadata-age:{client-id=producer-1}                              : 107.173
producer-metrics:network-io-rate:{client-id=producer-1}                           : 14484.335
producer-metrics:network-io-total:{client-id=producer-1}                          : 13470218.000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                        : 89132370.825
producer-metrics:outgoing-byte-total:{client-id=producer-1}                       : 82888007689.000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                 : 0.000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                 : 0.000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}              : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}              : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                         : 0.000
producer-metrics:record-error-total:{client-id=producer-1}                        : 0.000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                     : 282.441
producer-metrics:record-queue-time-max:{client-id=producer-1}                     : 982.000
producer-metrics:record-retry-rate:{client-id=producer-1}                         : 0.000
producer-metrics:record-retry-total:{client-id=producer-1}                        : 0.000
producer-metrics:record-send-rate:{client-id=producer-1}                          : 21502.501
producer-metrics:record-send-total:{client-id=producer-1}                         : 20000000.000
producer-metrics:record-size-avg:{client-id=producer-1}                           : 4182.000
producer-metrics:record-size-max:{client-id=producer-1}                           : 4182.000
producer-metrics:records-per-request-avg:{client-id=producer-1}                   : 2.970
producer-metrics:request-latency-avg:{client-id=producer-1}                       : 1.021
producer-metrics:request-latency-max:{client-id=producer-1}                       : 71.000
producer-metrics:request-rate:{client-id=producer-1}                              : 7242.083
producer-metrics:request-size-avg:{client-id=producer-1}                          : 12307.040
producer-metrics:request-size-max:{client-id=producer-1}                          : 12432.000
producer-metrics:request-total:{client-id=producer-1}                             : 6735109.000
producer-metrics:requests-in-flight:{client-id=producer-1}                        : 0.000
producer-metrics:response-rate:{client-id=producer-1}                             : 7241.987
producer-metrics:response-total:{client-id=producer-1}                            : 6735109.000
producer-metrics:select-rate:{client-id=producer-1}                               : 10995.694
producer-metrics:select-total:{client-id=producer-1}                              : 10300919.000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1} : 0.000
producer-metrics:successful-authentication-rate:{client-id=producer-1}            : 0.000
producer-metrics:successful-authentication-total:{client-id=producer-1}           : 0.000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}          : 0.000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}         : 0.000
producer-metrics:waiting-threads:{client-id=producer-1}                           : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--1}  : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-0}   : 156587.122
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}   : 153178.337
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-2}   : 153668.114
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--1} : 733.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-0}  : 143674848.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}  : 143682909.000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-2}  : 143690906.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--1}  : 0.000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-0}   : 30407034.972
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}   : 29424883.436
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-2}   : 29280766.049
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--1} : 101.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-0}  : 27908762850.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}  : 27596131924.000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-2}  : 27383112814.000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--1} : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-0}  : 2.029
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}  : 0.416
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-2}  : 0.595
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--1} : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-0}  : 57.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}  : 57.000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-2}  : 71.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--1}        : 0.000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-0}         : 2445.882
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}         : 2393.868
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-2}         : 2401.064
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--1}    : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-0}     : 12431.929
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}     : 12291.771
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-2}     : 12194.911
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--1}    : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-0}     : 12432.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}     : 12432.000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-2}     : 12432.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--1}       : 2.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-0}        : 2244915.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}        : 2245036.000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-2}        : 2245156.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--1}       : 0.000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-0}        : 2446.674
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}        : 2393.412
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-2}        : 2401.064
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--1}      : 2.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-0}       : 2244915.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}       : 2245036.000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-2}       : 2245156.000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=topic1}             : 88709467.104
producer-topic-metrics:byte-total:{client-id=producer-1, topic=topic1}            : 82510841629.000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=topic1}      : 1.000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=topic1}     : 0.000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=topic1}    : 0.000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=topic1}     : 0.000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=topic1}    : 0.000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=topic1}      : 21502.501
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=topic1}     : 20000000.000
pod "kafka-producer-perf" deleted